app/Controllers/adminuser.php

SELECT *
FROM `upload`
---
   public function upload()
{
    $data = [
        'title' => 'Upload Data User',
        'adminuser' => $this->adminuserModel->findAll()
    ];

    $uploadsMap = [];
    $uploadModelPath = APPPATH . 'Models/UploadModel.php';
    if (file_exists($uploadModelPath)) {
        $uploadModel = new \App\Models\UploadModel();
        $allUploads = $uploadModel->findAll();