app/Controllers/AdminNotifikasi.php

    public function index()
    {
        $model = new NotifikasiModel();

        $data['notifikasi'] = $model
            ->where('target_role', 'admin')
            ->orderBy('created_at', 'DESC')
            ->findAll();

        $data['unread_count'] = $model
            ->where('target_role', 'admin')
            ->where('status', 'baru')
            ->countAllResults();

        // tandai dibaca
        $model->where('target_role', 'admin')
              ->where('status', 'baru')
              ->set(['status' => 'dibaca'])
              ->update();
---
SELECT *
FROM `notifikasi`
WHERE `target_role` = 'admin'
ORDER BY `created_at` DESC
SELECT COUNT(*) AS `numrows`
FROM `notifikasi`
WHERE `target_role` = 'admin'
AND `status` = 'baru'
UPDATE `notifikasi` SET `status` = 'dibaca'
WHERE `target_role` = 'admin'
AND `status` = 'baru'