app/Controllers/bansos.php

SELECT *
FROM `upload`
WHERE `id_user` = '85'
 LIMIT 1
---
public function upload()
{
    $id_user = session('id_user');

    if (!$id_user) {
        return redirect()->to('/login');
    }

    // 1. Ambil data profil user
    $user = $this->data->getadminuser($id_user);

    // 2. TAMBAHAN BARU: Cek apakah user sudah pernah upload?
    $uploadModel = new \App\Models\UploadModel();

    // Cek database berdasarkan id_user
    $dataPengajuan = $uploadModel->where('id_user', $id_user)->first();