app/Controllers/BaseController.php

   protected function injectUnreadCount()
{
    $renderer = \Config\Services::renderer();

    if (session()->get('logged_in') && session()->get('role') === 'admin') {
        $notifModel = new \App\Models\NotifikasiModel();

        $unread_count = $notifModel
            ->where('target_role', 'admin')
            ->where('status', 'baru')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `notifikasi`
WHERE `target_role` = 'admin'
AND `status` = 'baru'