app/Models/berita.php

        public function getberita($idberita = false)
        {
                if ($idberita == false){
                    return $this->orderBy('id_berita', 'DESC')->findAll();
---
SELECT *
FROM `berita`
ORDER BY `id_berita` DESC